# SQL Lab

In this lab we will learn how to use execute SQL from the ipython notebook and practice some queries on the [Northwind sample database](https://northwinddatabase.codeplex.com/) that we used in Lesson 3.1.

You can access the data with this command:

    psql -h dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com -p 5432 -U dsi_student northwind
    password: gastudents

First of all let's install the ipython-sql extension. You can find instructions [here](https://github.com/catherinedevlin/ipython-sql).

In [1]:
!pip install ipython-sql

Requirement already satisfied (use --upgrade to upgrade): ipython-sql in /Users/jrcmalunay/anaconda/lib/python2.7/site-packages
Requirement already satisfied (use --upgrade to upgrade): prettytable in /Users/jrcmalunay/anaconda/lib/python2.7/site-packages (from ipython-sql)
Requirement already satisfied (use --upgrade to upgrade): ipython>=1.0 in /Users/jrcmalunay/anaconda/lib/python2.7/site-packages (from ipython-sql)
Requirement already satisfied (use --upgrade to upgrade): sqlalchemy>=0.6.7 in /Users/jrcmalunay/anaconda/lib/python2.7/site-packages (from ipython-sql)
Requirement already satisfied (use --upgrade to upgrade): sqlparse in /Users/jrcmalunay/anaconda/lib/python2.7/site-packages (from ipython-sql)
Requirement already satisfied (use --upgrade to upgrade): six in /Users/jrcmalunay/anaconda/lib/python2.7/site-packages (from ipython-sql)
You are using pip version 8.1.1, however version 8.1.2 is available.
You should consider upgrading via the 'pip install --upgrade pip' command.

Let's see if it works:

In [2]:
%load_ext sql

/Users/jrcmalunay/anaconda/lib/python2.7/site-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/Users/jrcmalunay/anaconda/lib/python2.7/site-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [3]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
select * from orders limit 5;

5 rows affected.

[(10248, u'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, u'Vins et alcools Chevalier', u"59 rue de l'Abbaye", u'Reims', None, u'51100', u'France'),
 (10249, u'TOMSP', 6, datetime.date(1996, 7, 5), datetime.date(1996, 8, 16), datetime.date(1996, 7, 10), 1, 11.61, u'Toms Spezialit\xe4ten', u'Luisenstr. 48', u'M\xfcnster', None, u'44087', u'Germany'),
 (10250, u'HANAR', 4, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 12), 2, 65.83, u'Hanari Carnes', u'Rua do Pa\xe7o, 67', u'Rio de Janeiro', u'RJ', u'05454-876', u'Brazil'),
 (10251, u'VICTE', 3, datetime.date(1996, 7, 8), datetime.date(1996, 8, 5), datetime.date(1996, 7, 15), 1, 41.34, u'Victuailles en stock', u'2, rue du Commerce', u'Lyon', None, u'69004', u'France'),
 (10252, u'SUPRD', 4, datetime.date(1996, 7, 9), datetime.date(1996, 8, 6), datetime.date(1996, 7, 11), 2, 51.3, u'Supr\xeames d\xe9lices', u'Boulevard Tirou, 255', u'Charleroi', None, u'B-6000', u'Belgium')]

Nice!!! We can now go ahead with the lab!

In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

## 1: Inspect the database

If we were connected via console, it would be easy to list all tables using `\dt`. We can however access table information performing a query on the `information_schema.tables` table.

### 1.a: List Tables

1. write a `SELECT` statement that lists all the tables in the public schema of the `northwind` database, sorted alphabetically

In [16]:
from sqlalchemy import create_engine
import pandas as pd
engine = create_engine('postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com:5432/northwind')


pd.read_sql("SELECT * FROM pg_catalog.pg_tables WHERE schemaname='public'", con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers
0,public,categories,dsi,None,True,False,False
1,public,customercustomerdemo,dsi,None,True,False,False
2,public,customerdemographics,dsi,None,True,False,False
3,public,customers,dsi,None,True,False,False
4,public,employees,dsi,None,True,False,False
5,public,employeeterritories,dsi,None,True,False,False
6,public,order_details,dsi,None,True,False,False
7,public,orders,dsi,None,True,False,False
8,public,products,dsi,None,True,False,False
9,public,region,dsi,None,True,False,False
10,public,shippers,dsi,None,True,False,False
11,public,shippers_tmp,dsi,None,True,False,False
12,public,suppliers,dsi,None,True,False,False
13,public,territories,dsi,None,True,False,False
14,public,usstates,dsi,None,False,False,False

In [181]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT *
FROM

LIMIT 5;

0 rows affected.

[]

### 1.b: Print Schemas

The table `INFORMATION_SCHEMA.COLUMNS` contains schema information on each.

Query it to display schemas of all the public tables. In particular we are interested in the column names and data types. Make sure you only include public schemas to avoid cluttering your results with a bunch of postgres related stuff.

In [18]:
# Because doesn't have `DESCRIBE [table]`
def describe_table(table="orders", connection=engine):
    
    sql = """
    SELECT
        column_name, data_type
    FROM
        information_schema.COLUMNS
    WHERE
        TABLE_NAME = '%s'
    """ % table

    return pd.read_sql(sql, con=connection)

describe_table("orders", connection=engine)

       column_name          data_type
0          OrderID           smallint
1       CustomerID          character
2       EmployeeID           smallint
3        OrderDate               date
4     RequiredDate               date
5      ShippedDate               date
6          ShipVia           smallint
7          Freight               real
8         ShipName  character varying
9      ShipAddress  character varying
10        ShipCity  character varying
11      ShipRegion  character varying
12  ShipPostalCode  character varying
13     ShipCountry  character varying

### 1.c: Table peek

Another way of quickly looking at table information is to query the first few rows. Do this for a couple of tables, for example: `orders`, `products`, `usstates`. Display only the first 3 rows.

In [22]:
sql = """
SELECT * FROM orders LIMIT 3
"""

pd.read_sql(sql, con=engine)

,OrderID,CustomerID,EmployeeID,OrderDate,RequiredDate,ShippedDate,ShipVia,Freight,ShipName,ShipAddress,ShipCity,ShipRegion,ShipPostalCode,ShipCountry
0,10248,VINET,5,1996-07-04,1996-08-01,1996-07-16,3,32.38,Vins et alcools Chevalier,59 rue de l'Abbaye,Reims,None,51100,France
1,10249,TOMSP,6,1996-07-05,1996-08-16,1996-07-10,1,11.61,Toms Spezialitäten,Luisenstr. 48,Münster,None,44087,Germany
2,10250,HANAR,4,1996-07-08,1996-08-05,1996-07-12,2,65.83,Hanari Carnes,"Rua do Paço, 67",Rio de Janeiro,RJ,05454-876,Brazil

In [25]:
sql = """
SELECT * FROM products LIMIT 3
"""

pd.read_sql(sql, con=engine)

,ProductID,ProductName,SupplierID,CategoryID,QuantityPerUnit,UnitPrice,UnitsInStock,UnitsOnOrder,ReorderLevel,Discontinued
0,1,Chai,8,1,10 boxes x 30 bags,18.0,39,0,10,1
1,2,Chang,1,1,24 - 12 oz bottles,19.0,17,40,25,1
2,3,Aniseed Syrup,1,2,12 - 550 ml bottles,10.0,13,70,25,0

In [69]:
sql = """
SELECT * FROM categories LIMIT 3
"""

pd.read_sql(sql, con=engine)

,CategoryID,CategoryName,Description,Picture
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales",[]
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an...",[]
2,3,Confections,"Desserts, candies, and sweet breads",[]

As you can see, some tables (like `usstates` or `region`) contain information that is probably less prone to change than other tables (like `orders` or `order_details`). This database is well organized to avoid unnecessary duplication. Let's start digging deeper in the data.

## 2: Products

What products is this company selling? The `products` and `categories` tables contain information to answer this question.

Use a combination of SQL queries and Pandas merge to answer the following questions:

- What categories of products is the company selling?
- How many products per category does the catalog contain?
- Let's focus only on products that have not been discontinued => how many products per category?
- What are the most expensive 5 products (not discontinued)?
- How many units of each of these 5 products are there in stock?
- Draw a pie chart of the categories, with slices that have the size of the number of products in that category (use non discontinued products)

### 2.a: What categories of products is the company selling?

Remember that PostgreSQL is case sensitive.

In [80]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT "CategoryID", "CategoryName" FROM categories;

8 rows affected.

[(1, u'Beverages'),
 (2, u'Condiments'),
 (3, u'Confections'),
 (4, u'Dairy Products'),
 (5, u'Grains/Cereals'),
 (6, u'Meat/Poultry'),
 (7, u'Produce'),
 (8, u'Seafood')]

### 2.b: How many products per category does the catalog contain?

Keep in mind that you can cast a %sql result to a pandas dataframe using the `.DataFrame()` method.

In [79]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
SELECT "CategoryID", COUNT("ProductName")
FROM products
GROUP BY "CategoryID"
ORDER BY "CategoryID" ASC;

8 rows affected.

[(1, 12L), (2, 12L), (3, 13L), (4, 10L), (5, 7L), (6, 6L), (7, 5L), (8, 12L)]

### 2.c: How many not discontinued products per category?

In [84]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
SELECT "Discontinued", COUNT("Discontinued")
FROM
products
GROUP BY "Discontinued";

2 rows affected.

[(0, 67L), (1, 10L)]

### 2.d: What are the most expensive 5 products (not discontinued)?

In [120]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
SELECT "CategoryID", "ProductName","UnitPrice", "Discontinued"
FROM
products
WHERE "Discontinued" = 0
ORDER BY "UnitPrice" DESC
LIMIT 5;

5 rows affected.

[(1, u'C\xf4te de Blaye', 263.5, 0),
 (3, u"Sir Rodney's Marmalade", 81.0, 0),
 (8, u'Carnarvon Tigers', 62.5, 0),
 (4, u'Raclette Courdavault', 55.0, 0),
 (7, u'Manjimup Dried Apples', 53.0, 0)]

### 2.e: How many units of each of these 5 products are there in stock?

In [121]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
SELECT "CategoryID","ProductName","UnitPrice", "Discontinued","UnitsInStock"
FROM
products
WHERE "Discontinued" = 1
ORDER BY "UnitPrice" DESC
LIMIT 5;

5 rows affected.

[(6, u'Th\xfcringer Rostbratwurst', 123.79, 1, 0),
 (6, u'Mishi Kobe Niku', 97.0, 1, 29),
 (7, u'R\xf6ssle Sauerkraut', 45.6, 1, 26),
 (6, u'Alice Mutton', 39.0, 1, 0),
 (6, u'Perth Pasties', 32.8, 1, 0)]

### 2.f: Pie Chart

Use pandas to make a pie chart plot.

## 3: Orders

Now that we have a better understanding of products, let's start digging into orders.

- How many orders in total?
- How many orders per year
- How many orders per quarter
- Which country is receiving the most orders
- Which country is receiving the least
- What's the average shipping time (ShippedDate - OrderDate)
- What customer is submitting the highest number of orders?
- What customer is generating the highest revenue (need to pd.merge with order_details)
- What fraction of the revenue is generated by the top 5 customers?

In [103]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
SELECT * FROM orders LIMIT 1;

1 rows affected.

[(10248, u'VINET', 5, datetime.date(1996, 7, 4), datetime.date(1996, 8, 1), datetime.date(1996, 7, 16), 3, 32.38, u'Vins et alcools Chevalier', u"59 rue de l'Abbaye", u'Reims', None, u'51100', u'France')]

### 3.a: How many orders in total?

In [101]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
SELECT COUNT(*) FROM orders;

1 rows affected.

[(830L,)]

### 3.b: How many orders per year?

In [132]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

        
SELECT EXTRACT(YEAR FROM "OrderDate"), COUNT("OrderDate")
FROM
orders
GROUP BY EXTRACT(YEAR FROM "OrderDate");

3 rows affected.

[(1997.0, 408L), (1998.0, 270L), (1996.0, 152L)]

### 3.c: How many orders per quarter?

Make a line plot for these.

In [149]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

        
SELECT EXTRACT(QUARTER FROM "OrderDate"), COUNT("OrderDate")
FROM
orders
GROUP BY EXTRACT(QUARTER FROM "OrderDate");

4 rows affected.

[(4.0, 202L), (1.0, 274L), (2.0, 181L), (3.0, 173L)]

In [ ]:
ORDER BY EXTRACT(MONTH FROM "OrderDate") ASC

### 3.d: Which country is receiving the most orders?

In [153]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT "ShipCountry", COUNT("OrderID")
FROM
orders
GROUP BY "ShipCountry"
ORDER BY COUNT("OrderID") DESC
LIMIT 1;

1 rows affected.

[(u'Germany', 122L)]

### 3.e: Which country is receiving the least?

In [154]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
        
SELECT "ShipCountry", COUNT("OrderID")
FROM
orders
GROUP BY "ShipCountry"
ORDER BY COUNT("OrderID") ASC
LIMIT 1;

1 rows affected.

[(u'Norway', 6L)]

### 3.f: What's the average shipping time (ShippedDate - OrderDate)?

In [172]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT AVG("ShippedDate" - "OrderDate")
FROM 
orders;

1 rows affected.

[(Decimal('8.4919653893695921'),)]

### 3.g: What customer is submitting the highest number of orders?

In [178]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT "CustomerID", COUNT("OrderID")
FROM
orders
GROUP BY "CustomerID"
ORDER BY COUNT("OrderID") DESC
LIMIT 1;

1 rows affected.

[(u'SAVEA', 31L)]

### 3.h: What customer is generating the highest revenue (need to pd.merge with order_details)?

In [192]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT "Freight"
FROM 
orders
LIMIT 5;

5 rows affected.

[(32.38,), (11.61,), (65.83,), (41.34,), (51.3,)]

In [219]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT "OrderID", ("UnitPrice" * "Quantity") AS totalprice
FROM
order_details
OFFSET 7
LIMIT 1;

1 rows affected.

[(10250, 251.999988555908)]

In [290]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT *, ("UnitPrice" * "Quantity") - (("UnitPrice" * "Quantity"*"Discount")) + "Freight" AS total_rev
FROM
order_details
LEFT JOIN 
orders ON
order_details."OrderID" = orders."OrderID"
ORDER BY "total_rev" DESC
LIMIT 1;

1 rows affected.

[(10981, 38, 263.5, 60, 0.0, 10981, u'HANAR', 1, datetime.date(1998, 3, 27), datetime.date(1998, 4, 24), datetime.date(1998, 4, 2), 2, 193.37, u'Hanari Carnes', u'Rua do Pa\xe7o, 67', u'Rio de Janeiro', u'RJ', u'05454-876', u'Brazil', 16003.3699951172)]

### 3.i: What fraction of the revenue is generated by the top 5 customers?

Compare that with the fraction represented by 5 customers over the total number of customers.

In [286]:
# %%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind
# SELECT  FROM order_details

In [292]:
%%sql postgresql://dsi_student:gastudents@dsi.c20gkj5cvu3l.us-east-1.rds.amazonaws.com/northwind

SELECT "CustomerID", (("UnitPrice" * "Quantity") - (("UnitPrice" * "Quantity"*"Discount")) + "Freight") AS total_rev
FROM
order_details
LEFT JOIN 
orders ON
order_details."OrderID" = orders."OrderID"
GROUP BY "CustomerID", "total_rev"
ORDER BY "total_rev" DESC
LIMIT 5;

5 rows affected.

[(u'HANAR', 16003.3699951172),
 (u'QUICK', 15367.6400028691),
 (u'RATTC', 10820.6099853516),
 (u'SIMOB', 10610.2901535034),
 (u'HUNGO', 10506.7400512695)]

Wow!! 5.5% of the customers generate a third of the revenue!!

## Bonus: Other tables

Investigate the content of other tables. In particular lookt at the `suppliers`, `shippers` and `employees` tables.